Merge pull request #99 from bluelibs/feat/6.4
6.4
